[{"title": "Business Development Executive,Inside Sales,Admissions Counselor", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=__PLUS__bzA8xePcM5zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Key roles and responsibilities: Provide guidance on academic programs, course selection, and degree requirements. Generating pipelines and closing the deals. Guide prospective students through the application process. Provide information on admission requirements, deadlines, and necessary documents. Review and evaluate applications to ensure they meet admission criteria. Offer personalized counseling to prospective students regarding academic programs, majors, and career paths.", "companyname": "PHEONIX", "location": "Bengaluru / Bangalore", "experience": "0 - 2 yrs", "salary": "", "type": "", "skills": "sales, communication, time management", "startdate": "", "enddate": "Oct 7, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Requirement For Airport", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=NOvLkT1C6lFzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description(Urgent opening for Any Under Grad/Graduated holders)Dear candidates,1)Requirement available in Air Ticketing / Ground Staff/ Cabin Crew/ Air Hostess.3)Qualification:-Any Under Grad/Graduated (Freshers & Experience)3)Vacancies:-104)Job Location:- Pan India5)Experience:-Freshers6)Salary: - As per Industry7)Duty: - 8 hoursInterested candidates please send your resume onwhatsapp or call : ( 92 66 71 38 95 )Regards,HR Department", "companyname": "VK Jobs", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Kolkata", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Airport Security, Administration, system admin, Ground staff, Cabin Crew, Air Ticketing, Air Hostess, flight attendant, HRcall9266713895", "startdate": "", "enddate": "Nov 6, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Dietician/Nutritionist", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=26YfZW7nY2VzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "CALL FOR MORE INFO :(AMAN-NINE EIGHT SIX THREE NINE THREE SEVEN SEVEN THREE SIX)Responsibilities:Assess patients' dietary needs and develop personalized nutrition plans based on Ayurvedic principles.Educate patients on healthy eating habits and lifestyle changes to improve overall health.Monitor and document patients' progress, making adjustments to diet plans as needed.Collaborate with Ayurvedic doctors to ensure comprehensive and integrated patient care.Stay updated with the latest in nutrition science and Ayurvedic dietary practices to provide the best care possible. Follow up consultation of Patients.Required Skills and Qualifications:Bachelor's degree in Dietetics, Nutrition, or a related field.Certified Dietician/Nutritionist.Knowledge of Ayurvedic dietary principles is a plus.Strong communication and interpersonal skills to effectively educate and motivate patients.Ability to create and implement customized diet plans tailored to individual patient needs.Passion for holistic health and wellness, with a commitment to patient-centered care.Experience in patient counseling and education is highly desirable.", "companyname": "SKYWALK VISA IMMIGRATION SERVICES LLP", "location": "Bengaluru / Bangalore,  Singapore", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "dietician, Diet Counselling, Diet Planning, Dietitian, Nutritionist, Dietetics, Weight Management, Nutrition Education", "startdate": "", "enddate": "Nov 6, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Agency Business Associate Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=x2hqQGokYCxzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We Are Looking For a Agency Business Associate ManagerRoles & Responsibility:-- Team Leader's Profile- Forming an Advisory Council- Support advisors in carrying out their responsibilities more skillfully- In charge of the distribution network- Boost income for the company", "companyname": "TEKPILLAR SERVICES PRIVATE LIMITED", "location": "Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Kolkata,  Mangalore,  Bhubaneshwar", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Telecom, CASA, Medical, Real Estate, Credit, B2C, B2B, Direct, Equity, BFSI, FMCG, Marketing, Field Sales, Agency Channel, MR", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Business  Development  Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=lv8dNQi2ZkhzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Roles and Responsibilities :- Find and get in touch with possible clients in order to expand your clientele.- Meet the demands of potential customers by showcasing goods and services.- Securing contracts requires finalizing sales agreements and negotiating terms.- For continued business, cultivate and preserve solid client relationships.- Achieve or surpass sales objectives and make a positive impact on the overall sales aim.- Monitor sales activity and results, updating management on a frequent basis.", "companyname": "TEKPILLAR SERVICES PRIVATE LIMITED", "location": "Bengaluru / Bangalore,  Kolkata,  Mangalore,  Bhubaneshwar,  Cuttack", "experience": "1 - 6 yrs", "salary": "", "type": "", "skills": "sales, banking, insurance, finance, distrubition, Team handling, leadership, lead generation, marketing, team leader, casa, Mutual Funds, advisor, business development, LOAN", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Virtual Interior Designer - J48015A", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=aVHJmGjxZH9zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Proficient knowledge of 3D visualization ability and working knowledge of the elements and principles of design Strong knowledge in AutoCAD and Revit Basic knowledge of Adobe Photoshop Strong Experience with lighting design (preferred) Proven ability to create 2D and 3D design drawings and renderings Ability to interpret and understand architectural details and specifications as used in construction documents General awareness of building and health codes for compliance Strong 3D visualization/rendering skills Strong attention to detail", "companyname": "SAMPOORNA CONSULTANTS PVT LTD", "location": "Bengaluru / Bangalore", "experience": "3 - 6 yrs", "salary": "", "type": "", "skills": "Design", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Primary School Teacher", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=a72eB7__SLASH__C4qRzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "CALL FOR MORE INFO :(AMAN-NINE EIGHT SIX THREE NINE THREE SEVEN SEVEN THREE SIX)Responsibilities:Develop and implement age-appropriate lesson plans and activities.Foster a positive and inclusive classroom environment.Encourage children's social, emotional, and intellectual development.Monitor and track the progress of each child.Communicate regularly with parents about their child's progress.Maintain a clean and safe classroom.Collaborate with other teachers and staff to enhance the educational experience.Attend staff meetings and professional development sessions.Bachelors degree in Early Childhood Education or related field. Previous experience working with young children.Strong communication and interpersonal skills.Patience, creativity, and a passion for teaching.Ability to create a safe and engaging learning environment.Basic understanding of child development principles.Fluency in English.", "companyname": "SKYWALK VISA IMMIGRATION SERVICES LLP", "location": "Bengaluru / Bangalore,  New York City,  New Zealand,  Singapore", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "Education, Teaching And Instructing, Teaching, Classroom Teacher, Primary Teacher", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Manufacturing Mechanical Engineer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=etXkiMuMcKxzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job DescriptionCall or Whatsapp to check your eligibilityAman - Nine eight six three nine three seven seven three six Manufacturing Engineer Responsibilities:Evaluating existing manufacturing processes and identifying areas for improvement.Determining problem resolutions and implementing improvements.Developing detailed layouts for equipment, processes, and workflow.Researching and developing new processes, equipment, and products.Developing and implementing cost-saving measures and quality control systems.Ensuring manufacturing processes, equipment, and products comply with safety standards and legal regulations.Maintaining research and activity documentation and preparing reports.Manufacturing Engineer Requirements:", "companyname": "SKYWALK VISA IMMIGRATION SERVICES LLP", "location": "Bengaluru / Bangalore,  Germany,  Singapore,  null", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Production Engineer, service engineer, senior service engineer, customer support engineer, desktop support engineer, network engineer, network administrator", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Anethesia technician", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=2L8__SLASH__XoOfsFFzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Call or Whatsapp to check your eligibilityAman - Nine eight six three nine three seven seven three six Job DescriptionManaging painAnesthesiologists control a patient's pain and level of consciousness.They may also prescribe pain-relieving medication. Ensuring a safe recoveryAnesthesiologists ensure that patients awaken from anesthesia safely.They also support patients through recovery.Responding to emergenciesAnesthesiologists respond to any emergencies or unexpected developments during surgery. Working with other healthcare providersAnesthesiologists work closely with surgeons, nurses, and other healthcare providers. Creating care plansAnesthesiologists create patient-specific care plans. Monitoring vital signsAnesthesiologists monitor a patient's heart rate, breathing, blood pressure, body temperature, and body fluid balance.", "companyname": "SKYWALK VISA IMMIGRATION SERVICES LLP", "location": "Bengaluru / Bangalore,  Australia,  Germany,  null,  null", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "Critical Care, Icu, Therapy, Cases, Anesthesia technical, General Anesthesia, Regional Anesthesia, Intensive Care, Emergency Care, Patient Care, Self Motivated, Cardiac", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Python Developer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=k2KEI3OdhX5zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Apply to know more or contact us for more info todayAman - Nine eight six three nine three seven seven three six Write effective, scalable codeDevelop back-end components to improve responsiveness and overall performanceIntegrate user-facing elements into applicationsTest and debug programsImprove functionality of existing systemsImplement security and data protection solutionsAssess and prioritize feature requestsCoordinate with internal teams to understand user requirements and provide technical solutions", "companyname": "SKYWALK VISA IMMIGRATION SERVICES LLP", "location": "Bengaluru / Bangalore,  Australia,  Canada,  Germany,  New Zealand", "experience": "3 - 8 yrs", "salary": "", "type": "", "skills": "Python Scripting, Data Analysis, Matlab, c ++, Sql, Data Visualization, Mysql", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Programmatic Campaign  Analyst", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=DCxs8nAgEyVzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Role Programmatic Campaign Quality Analyst The Programmatic Campaign Quality Analyst must have a proven track record of QA testing in all aspects of programmatic campaign management including trafficking optimization and campaign reporting As a valued member of the division you will have a tremendous amount of responsibility and support to help exceed campaign performance targets The ideal candidate will have a thorough understanding of programmatic display and video campaign management Responsibilities Complete knowledge of the Programmatic campaign set up and execution process Work closely with account management teams to ensure accuracy in set up strategy and execution for Ensure that endtoend QA of display campaigns including tagging trafficking and optimization Ensure bestinclass email quality by implementing rigorous QA practices Perform endtoend QA of the campaignjourney setup and identify areas of improvements Work crossfunctionally with the Operations team business stakeholders to drive high quality QA processes Ensure the project is delivered on time Work with the account management team to deliver error free reporting and campaign updates as needed Requirements Minimum 3 year of experience in programmatic digital media preferably for a media agency in QA Testing role", "companyname": "LTIMindtree Ltd.", "location": "Bengaluru / Bangalore", "experience": "3 - 6 yrs", "salary": "", "type": "", "skills": "Adobe Campaign", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Distributor of crypto-products", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=H6MRjdNBfpVzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Distributor of crypto-productsWe invite energetic and motivated candidates for the position of cryptocurrency products consultant. Your key task is to actively develop and maintain your own portfolio of clients, promote cryptocurrency products and advise on their use and investment. Responsibilities:Active attraction of new clients and development of the existing client base.Selling and promoting the company's cryptocurrency products.Consulting on the use of cryptocurrency products.Monitoring the cryptocurrency market, analyzing trends and new projects. Requirements: Experience in cryptocurrency or traditional finance will be an advantage.A desire to develop and achieve results.Excellent communication and persuasive skills.Knowledge of the basics of cryptocurrencies (Bitcoin, Ethereum) and blockchain technology.Passion for technology and willingness to constantly learn new things in a fast-paced industry.High self-discipline and result-oriented.We offer:Attractive salary and bonuses for achieving goals.Professional development and career growth opportunities.A friendly and supportive team.Fully remote work with a flexible schedule.", "companyname": "Fintech_HR", "location": "Bengaluru / Bangalore,  Delhi,  Delhi/NCR,  Gurgaon,  Lucknow", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Financial sales", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Field  Sales Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=JhsA7cPIrWdzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We Are Looking For a Field Sales ManagerRoles & Responsibility:- Profile of the Team Leader Establishing an Advisory Board Assist advisors in performing their duties more successfully Manage the network of distribution Increase the organization's revenue", "companyname": "TEKPILLAR SERVICES PRIVATE LIMITED", "location": "Bengaluru / Bangalore,  Kolkata,  Warangal,  Mangalore,  Bhubaneshwar", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Telecom, CASA, Medical, Real Estate, Credit, B2C, B2B, Direct, Equity, BFSI, FMCG, Marketing, Field Sales, Agency Channel, MR", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Hiring Sales Manager | Banca Channel", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=oGdhEwx__PLUS__pURzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Hiring For a Leading Life Insurance Company for Bancassurance CTC: Upto 4.50 lpa+ inc + rem Experience: Min 1 year in Life Insurance sales and BFSI Sales. Qualification: Min Graduation is Mandatory Role- Sales Manager Channel: Bancassurance channelRole Summary :Build and maintain strong relationships with branch managers and other bank personnel within a designated territory.Identify and qualify potential insurance leads from the bank's customer base.Understand and effectively explain the features and benefits of various insurance products, including life insurance, health insurance, and other relevant offerings.Match client needs with suitable insurance solutions, ensuring clear communication of risks and benefits.Assist bank staff in the sales process, providing training and support for effective product promotion.Process insurance applications accurately and efficiently, ensuring adherence to company guidelines and regulatory requirements.Monitor and analyze sales performance, identifying areas for improvement and exceeding assigned sales targets.Contribute to the development and implementation of effective sales strategies within the branch network.Interested candidates kindly share your resumes", "companyname": "TEKPILLAR SERVICES PRIVATE LIMITED", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Cochin/ Kochi/ Ernakulam,  Coimbatore", "experience": "1 - 6 yrs", "salary": "", "type": "", "skills": "Sales, Banca, Insurance, channel, Direct, Broking, Life insurance, Corporate, Finance, Investment, Banking, CASA, Health  insurance, General insurance, Credit cards, RM, BDM", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "School Teacher", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=e0wRvQpPpSFzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Apply to know more or contact us for more info todayAman - Nine eight six three nine three seven seven three sixResponsibilitiesResponsible for the complete upkeep of the assigned classrooms and all other ancillaryenvironments part of the day schedule in the year. Plans and Prepares materials for activities & display boards for current and forthcoming topics.", "companyname": "SKYWALK VISA IMMIGRATION SERVICES LLP", "location": "Bengaluru / Bangalore,  Chennai,  Australia,  New Zealand,  Singapore", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Teaching, Lecturer, Kindergarten Teacher, Nursery Teacher, Education, Primary Teacher", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Senior Product Designer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=r56TO7aThfBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Title: Senior Product Designer.Key Responsibilities:Design Leadership:Lead and manage design projects from concept through delivery, ensuring high-quality and user-centric outcomes.Develop and communicate design strategies, principles, and standards to guide the team and align with business objectives.Mentor and provide feedback to junior designers, fostering their professional growth and enhancing the overall design capability of the team.User-Centered Design:Conduct user research, including interviews, surveys, and usability testing, to gather insights and inform design decisions.Create detailed wireframes, prototypes, and high-fidelity mockups that effectively communicate design concepts and solutions.Define and document user personas, user journeys, and interaction flows to support a comprehensive understanding of user needs.Collaboration and Communication:Partner with product managers, engineers, and other stakeholders to define project requirements and ensure alignment with design goals.Present and articulate design concepts, rationale, and solutions to stakeholders and leadership teams.Participate in design critiques and collaborative sessions, contributing constructive feedback and iterative improvements.Innovation and Strategy:Stay up-to-date with industry trends, emerging technologies, and best practices to continuously evolve and innovate design approaches.Contribute to the development and maintenance of design systems, ensuring consistency and scalability across products.Project Management:Manage multiple design projects simultaneously, prioritizing tasks and meeting deadlines in a fast-paced environment.Define and track key metrics to evaluate the success of design solutions and iterate based on user feedback and performance data.", "companyname": "Electrobrain modern technologies pvt ltd", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "Design Expertise, User-Centered Design, Technical Skills, Leadership and Collaboration, Strategic Thinking, Analytical Skills", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Customer Service & Sales Associate,Team Leader", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=1__PLUS__HzNNW6XIZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "A Customer Service Representative, or CSR, will act as a liaison, provide product/services information, answer questions, and resolve any emerging problems that our customer accounts might face with accuracy and efficiency.The best CSRs are genuinely excitedto help customers. They re patient, empathetic, and passionatelycommunicative. They love to talk and understand the value of good communication skills. Customer service representatives can put themselves in their customers shoes and advocate for them when necessary. Customer feedback is priceless, and these CSRs can gather that for you. Problem-solving also comes naturally to customer care specialists. They are confident at troubleshooting and investigate if they don t have enough information to answer customer questions or resolve complaints.The target is to ensure excellent service standards, respond efficiently to customer inquiries and maintain high customer satisfaction.ResponsibilitiesCustomer Service Responsibilities list:Manage large amounts of incoming phone callsGenerate sales leadsIdentify and assess customers needs to achieve satisfactionBuild sustainable relationships and trust with customer accounts through open and interactive communicationProvide accurate, valid and complete information by using the right methods/toolsMeet personal/customer service team sales targets and call handling quotasHandle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolutionKeep records of customer interactions, process customer accounts and file documentsFollow communication procedures, guidelines and policiesTake the extra mile to engage customers", "companyname": "Rina Israni", "location": "Ahmedabad,  Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Kolkata,  Pune", "experience": "12 - 17 yrs", "salary": "", "type": "", "skills": "Sales Manager, assistant sales manager", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Vacancy for Junior Executive at AAI Airport 92662&37706,HR ,✈️", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=YGSPJN5LsVBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Jobs in Airline Aviation all domestic and international airport call me for this job. HRD Miss Meenakshi Rawat +91 92662&37706VACANCY OPEN FOR AIRPORT JOBS AIRLINES AVIATION ALL INTERESTED CANDIDATES.Hurry Up! Lots Of Jobs In Airport & Aviation Industry Interested Candidate In Being a Of Job The Airline Family Seats Are Available. Job location:- nearest Airport'sStarting salary 29500 to 45500 Airlines Job Opened @ Ground staff and Air ticketing, CCE , Cabin Crew, Luggage Dept. , Front Desk , Floor supervisor , Manager, Helper, Loader, Executive and other so many post required manpower.Qualification: - 8th , 10th, 12th Pass to graduate & Post Graduate (Hospitality Aviation must apply) SA , CSA , BR , BA , CCE, Electrician & Technical operator, Tag Boy , Food Counter , Luggage Counter , Front Desk, Helper, Loader, Assistant Superviser, Driver, Assistant Floor In-charge, Computer Operator, Air Ticket In-Charge, Cabin Crew, Supervisor, Manager, ETC.GROUND STAFF Job- Male/Female, Fresher/Experience Both type Job Candidates required. Freshers and Experienced both are welcome. INTERESTED CANDIDATE MUST APPLY Air ticketing, Technical & Mechanical, Service Associate (SA), Customer support Associate (CSA), Passport Checking, Luggage Scanning operator , Computer operator , Supervisor ,Cashier, Tag boy, Loader, Helper, Driver other so many posts.Facilities: Living, medical, fund, bounce, insurance, over time. 8 hours duty Sunday off, medical leaves and all national holidays.Job location all over India , nearest to your district No consultancy ,direct recruitment.Only interested candidates please send your contact details.Airlines HR Miss Meenakshi Rawat +91 92662&37706 Thanks and Regards Aviation Department", "companyname": "Sandeep K", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Ground staff, computer operator, data entry, project manager, Air ticketing, Cabin crew, HR, Hospitality, Customer Service, Security gard, Housekeeping, Banking, Accountant", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Urgent Hiring For Flight Attendant / Aircraft Maintenance", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=7q5zz4kiiihzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Dear Candidate,Greeting for the day!We are Hiring for the jobs for the position of Air Ticketing / Ground Staff / Cabin Crew / Maintenance Engineer/Airport ManagementJob Description : Handling airlines ticket booking mails from both internal external customers. Taking care of the safety and security of the passengers on flights. Need to Serve Meals on Board to the Customers with a Hospitality Attitude Person should have unblemished complexion and good body language. Excellent verbal and written communication skills in both Hindi and English.ADVANTAGES:-1. OPPORTUNITY TO JOIN THE FASTEST GROWING ORGANIZATION.2. AFTER COMPLETING 15-18 MONTHS YOU CAN APPLY IN ANY RESPECTIVE DEPT RELATED TO YOUR FIELD.3. LUCRATIVE PACKAGES.other detailsDepartment:Airport / Airline /Ground Staff / Cabin CrewIndustry:Aviation / AirlineEligibility Criteria : Height Will not be a issue for GROUND STAFF & Air Ticketing Executive Should not be overweight or underweight, Should not have any visible marks, scars and tattoos. Fresher +2 can also apply Age 18-25 YearsSalary Starts from 25,000 till 75,000 Rs in Hand + Free Home pick up & Drop cabs.Work and Training from home is also availableUrgent hiring for fresher candidates for leading airline companies*Male and female both can applySalary is starting from 18,000/- in hand+PF+ESI+Food allowance+Pick n dropLocation : Mumbai,Bangalore,Chennai,Hyderabad,Pune,Kolkata,Kochi,Lucknow,Jaipur,Indore.Job Responsibility:A boarding pass is a document provided by an airline during check-in, giving a passenger permission to enter the restricted area of an airport and to board the aeroplane for a particular flight. At a minimum, it identifies the passenger, the flight number, and the date and scheduled time for departure. In some cases, flyers can check-in online and print the boarding passes themselves. A boarding pass may be required for a passenger to enter a secure area of an airport.Interested candidate please share your resumeOr call HR Department : (96,16,64,27,93)Best RegardsHr Team.", "companyname": "Sarika Bhadauriya", "location": "Bengaluru / Bangalore,  Daman & Diu,  Jammu,  Srinagar,  Ranchi", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Airport Handling Operation Ground Handling, Airport Security, Flight Attendant, Ground Staff, Cabin Crew, Air-Cargo, Air Ticketing, Administrative, Airport Management", "startdate": "", "enddate": "Nov 6, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Area Sales Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=b6gVoPmIWypzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We Are Looking For a Area sales Manager Roles & Responsibility:-- To grow your clientele, locate potential customers and get in contact with them.- Showcase products and services to satisfy the needs of prospective clients.- Signing sales agreements and settling on conditions are necessary for contract security.- Maintaining strong customer relationships is essential for corporate success.", "companyname": "TEKPILLAR SERVICES PRIVATE LIMITED", "location": "Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Kolkata,  Mangalore,  Bhubaneshwar", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Telecom, CASA, Medical, Real Estate, Credit, B2C, B2B, Direct, Equity, BFSI, FMCG, Marketing, Field Sales, Agency Channel, MR", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Front Line Sales Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=sPk0Cnd7SrBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Responsibilities:- To create a solid advisory basis, locate and draw in top-notch advisors.- Continue to impart knowledge about company policies, sales tactics, and merchandise.- Assist advisers with prospecting, business development, and lead creation.- Make certain that advisors follow relevant business procedures and standards while offering clients suitable financial solutions based on requirements analysis.- Achieve monthly business goals for hiring agency advisors and generating new business.-Maintain compliance with all business quality measures in sales made through the advisor team.- As the client's main point of contact, I will authenticate and validate their concerns with the relevant authorities.", "companyname": "TEKPILLAR SERVICES PRIVATE LIMITED", "location": "Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Kolkata,  Vijayawada,  Mangalore", "experience": "1 - 6 yrs", "salary": "", "type": "", "skills": "sales, distrubition, banking, finance, BFSI, lead generation, loan, mutual fund, Marketing, team handling, relationship, business development, advisor, leadership, pharma, b2b", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Sr Cloud SRE - J48208", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=dzOwI6eFdjpzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "The Cloud Engineer role is a hands-on role primarily responsible for the deployment, monitoring and uptime/SLA of a multi-tenanted, large scale SaaS Service.This role also has a Site Reliability Engineer (SRE) function to it, requiring an ability to use automation to push updates at scale to the SaaS service and perform automated monitoringThis role also involves participating in System Architecture and Design review for our cloud native applications, automation, monitoring and implementing security controls for our scalable and distributed system. The role is not restricted to operations, it may occasionally involve research & developmental efforts to assist our product roadmap and customer success.Responsibilities: Ensure overall uptime of the SaaS Service to meet the tight SLA commitments Perform deployment activities using Automation and DevOps tools Add Monitoring capability using DevOps and Cloud Monitoring tools. Monitor SaaS Service components and ensure uptime/availability Ensure Security of the SaaS Service through hardening and pro-active identification and reduction of possible threat vectors Active contribution to Compliance/Audit initiatives that guarantee conformance to high levels of Security standards/Quality standards of the SaaS Service Participate in the design review of the cloud infrastructure and DevOps framework, so as to define and enforce high availability and security practices for the application layer.", "companyname": "SAMPOORNA CONSULTANTS PVT LTD", "location": "Bengaluru / Bangalore", "experience": "6 - 9 yrs", "salary": "", "type": "", "skills": "Cloud", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Senior Programmatic Campaign Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=J__PLUS__uPCe3oLGtzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Role Senior Programmatic Campaign Manager Expert knowledge of digital programmatic buying with handson experience using demandside platforms for largescale clients Working knowledge of the holistic digital landscape video display social programmatic and marketing analytics Manage a team of programmatic professionals and lead the strategic development and execution of programmatic campaigns Build on existing level of programmatic expertise and develop a reputation for innovation and efficiency internally Experience working with budgets understanding of pacing and the ability to make necessary adjustments as required Understanding of the marketing funnel and the associated KPIs per funnel stage Net reach engagement viewthroughrate CTRs CPAs etc to provide insights into campaign performance and recommendations for future campaigns to the planner andor customer Good attention to detail and high own standards of work Good Excel working knowledge Experience in setup of DCO campaigns and have good knowledge of tracking tools Experience with data management building and integration of audience lists and setup of DCO campaigns Knowledge of and experience working with brand safety tools eg IAS or DoubleVerify as well as ad verification tools eg Nielsen Focus DSP Experience Setup Management Optimization and Reporting for online video and display Campaigns in several DSP Platforms like Prio 1 The Trade Desk Prio 2 DV360 Adform Xander Amazon Requirements 10 to 12 years of experience in managing programmatic campaigns for large clients Ability to develop and foster relationships with media partners Proficient in Microsoft Office Suite with knowledge of pivot tables basic formulas and visualizations", "companyname": "LTIMindtree Ltd.", "location": "Bengaluru / Bangalore", "experience": "10 - 12 yrs", "salary": "", "type": "", "skills": "Adobe Campaign", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "React Js Developer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Vs77oUgZRddzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Position: React Js Developer Experience: 8 Yrs Location: Bangalore Notice Period: Immediate joiners Primary Skills: ReactJs and Javascript Key Responsibilities: Develop and maintain user interfaces using ReactJS and related technologies. Collaborate with UX/UI designers to implement and improve user experience. Write clean, efficient, and reusable code following best practices and coding standards. Integrate APIs and third-party libraries into web applications. Optimize applications for maximum speed and scalability. Troubleshoot and debug applications to ensure high performance and user satisfaction. Stay updated with the latest industry trends and technologies to ensure best practices. Participate in code reviews and contribute to team knowledge sharing. Work closely with cross-functional teams to deliver high-quality software solutions. Required Skills and Qualifications: Proven experience as a ReactJS Developer or similar role. Strong proficiency in JavaScript (ES6 ) and TypeScript. Hands-on experience with ReactJS, including React Hooks and Redux. Proficiency in HTML5, CSS3, and responsive design principles. Experience with RESTful APIs and integrating them into applications. Familiarity with version control systems, such as Git. Knowledge of front-end build tools (e.g., Webpack, Babel) and package managers (e.g., npm, Yarn). Understanding of modern front-end development workflows and best practices. Experience with testing frameworks (e.g., Jest, Enzyme) is a plus. Excellent problem-solving skills and attention to detail. Strong communication and collaboration skills.", "companyname": "Araca Solutions", "location": "Bengaluru / Bangalore", "experience": "8 - 12 yrs", "salary": "", "type": "", "skills": "React", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Agency Development Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=8tjm6K2MHExzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We Are Looking For a Agency Development ManagerRoles & Responsibility:- Creating New Business Connections Instructors should be given guidance and assistance. For the designated territory, create and implement successful sales strategy. Examine sales data and market trends to maximize output and meet goals. Utilizing thorough data analysis, create and carry out a territory action plan. Modify sales strategies in light of field interactions and performance.", "companyname": "TEKPILLAR SERVICES PRIVATE LIMITED", "location": "Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Kolkata,  Bhubaneshwar,  Cuttack", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Telecom, CASA, Medical, Real Estate, Credit, B2C, B2B, Direct, Equity, BFSI, FMCG, Marketing, Field Sales, Agency Channel, MR", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Corporate Account Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=5zBAr5iQw2JzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Responsibilities: Build and maintain strong relationships with branch managers and other bank personnel within a designated territory. Assist bank staff in the sales process, providing training and support for effective product promotion.Process applications accurately and efficiently, ensuring adherence to company guidelines and regulatory requirements. Monitor and analyze sales performance, identifying areas for improvement and exceeding assigned sales targets.Contribute to the development and implementation of effective sales strategies within the branch network. Qualifications and Experience:Bachelor's degree in any discipline (preferred). Minimum 1 to 2 years of experience in sales and marketing in the Life Insurance domain.Strong understanding of life and/or health insurance products and their applications. Excellent communication, interpersonal, and presentation skills.", "companyname": "TEKPILLAR SERVICES PRIVATE LIMITED", "location": "Bellary,  Bengaluru / Bangalore,  Davanagere,  Hubli,  Mysoru / Mysore", "experience": "1 - 4 yrs", "salary": "", "type": "", "skills": "Sales, insurarance, CASA, NBFC, Loan Sales, Broking, Mutual Fund, Investment Bank, General Insurance, Team Handling, B2B, B2C, BFSI, Client Servicing", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Associate Principal - Software Engineering", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=zhuOxl__PLUS__AhUpzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "AEM Certified, experience in AEM Developer Java full stock in AEM Tool Responsibilities: -Install and configure Adobe Experience Manager (AEM) for on premise solutions or cloud-based solutions. -Design the component model that will be used to construct a Digital platform for both web and mobile using Adobe Experience Manager for global enterprises. -Configure OSGI settings for an AEM install base. -Install and Configure core code bundles for AEM related projects. -Effectively communicate physical architectural designs to customers and present design options/considerations. -Work collaboratively with product owners, technology partners to understand and clarify requirements -You will provide technical leadership, driving and performing best engineering practices to initiate, plan, and execute large-scale, cross-functional, and company-wise critical programs. -You will identify, leverage, and successfully evangelize opportunities to improve engineering productivity. -Produce system design documents and lead technical walk trough's. -Continuously improve the architecture and quality of the code -Develop AEM templates and components leveraging AEM Sightly framework. -Design Content targeting Scenarios and architect how those scenarios will be implemented in AEM and Adobe Target. Basic Qualifications: -Bachelor's /Master's Degree in Computer Science, Information Systems or equivalent. -A minimum of 10 years of experience in software engineering %2526 Architecture -4 years of Information Technology experience as an AEM Full stack Developer. -4 years' experience developing web applications, templates, and components using Adobe AEM 6.3 . -Extensive experience to core AEM features -sites, assets, workflows, tagging, User control etc. -Good understanding of AEM administration activities -Expertise to Build prototypes to evaluate alternate solutions/approaches with latest technology stack of AEM. -Building and deploying highly scalable REST APIs with a deep understanding of Java, C#, .NET Core, JavaScript, React JS, J2EE, Servlets, HTML and HTL/Sightly. -Knowledge on CICD Dev ops integration and design including deployment for AWS and others with Adobe AEM DAM. -Experience and Knowledge with Adobe AEM REST APIs. -Experience in React JS, JavaScript, ideally Typescript and building/integrating Single Page Web Applications with AEM (Adobe Experience Manager). -Experience in developing web pages using HTML/HTML5, XML, DHTML CSS/CSS3, JavaScript, React JS, HTML, jQuery, Bootstrap, Redux, Ajax, JSON, JQuery, LESS or SASS, Node, NPM, Webpack, TypeScript and experience in building cutting edge front-end technologies %2526 responsive applications. -Solid understanding of all Adobe AEM building blocks, including templates, structure, components, sling/HTL, dialogs, widgets, etc., and the AEM development and deployment process. -Experience developing custom components in AEM and exposing AEM content as REST API. -Strong Java, J2EE, and web development (HTML, JS, CSS, jQuery, Bootstrap, etc.) background with experience in building cutting edge web %2526 responsive applications. -Familiar with C#, .NET Core, Web API/GraphQL...etc -Able to demonstrate strong Object-oriented programming skills. Preferred Qualifications: -Proficient with software development lifecycle (SDLC) methodologies like SAFe, Agile, Test- driven development. -Certification in Adobe Experience Manager Developer Or Architect. -Excellent problem solving, analytical and technical troubleshooting skills. -Able to work well individually and with a team. Good work ethic, self-starter, and results oriented. -Excellent communication skills are essential, with strong verbal and writing proficiencies.", "companyname": "LTIMindtree Ltd.", "location": "Bengaluru / Bangalore", "experience": "10 - 12 yrs", "salary": "", "type": "", "skills": "Adobe AEM", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Agency Business Associate Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=LooEWaxMZRFzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We Are Looking For a Agency Business Associate ManagerRoles & Responsibility:- Profile of the Team Leader Establishing an Advisory Board Assist advisors in performing their duties more successfully Manage the network of distribution Increase the organization's revenue", "companyname": "TEKPILLAR SERVICES PRIVATE LIMITED", "location": "Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Kolkata,  Vijayawada,  Mangalore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Telecom, CASA, Medical, Real Estate, Credit, B2C, B2B, Direct, Equity, BFSI, FMCG, Marketing, Field Sales, Agency Channel, MR", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Apply Urgent Airport Jobs /Aircraft Maintenance /Airport Staff", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=mnWpwdolNMFzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Jobs in Airline Airport all Domestic and International Airport VACANCY OPEN FOR AIRPORT JOBS AIRLINES AVIATION ALL INTERESTED CANDIDATES.Hurry Up! Lots Of Jobs In Airport & Aviation Industry Interested Candidate In Being a Of Job The Airline Family Seats Are Available. Job location:- nearest Airport'sStarting salary 29500 to 85500 Airlines Job Opened @ Ground staff and Air ticketing, CCE , Cabin Crew, Luggage Dept. , Front Desk , Floor supervisor , Manager, Helper, Loader, Executive and other so many post required manpower.Qualification: - 8th , 10th, 12th Pass to graduate & Post Graduate (Hospitality Aviation must apply) SA , CSA , BR , BA , CCE, Electrician & Technical operator, Tag Boy , Food Counter , Luggage Counter , Front Desk, Helper, Loader, Assistant Superviser, Driver, Assistant Floor In-charge, Computer Operator, Air Ticket In-Charge, Cabin Crew, Supervisor, Manager, ETC.GROUND STAFF Job- Male/Female, Fresher/Experience Both type JobCandidates required. Fresher s and Experienced both are welcome. INTERESTED CANDIDATE MUST APPLYAir ticketing, Technical & Mechanical, Service Associate (SA), Customer support Associate (CSA), Passport Checking, Luggage Scanning operator , Computer operator , Supervisor ,Cashier, Tag boy, Loader, Helper, Driver other so many posts.Facilities:Living, medical, fund, bounce, insurance, over time. 8 hours duty Sunday off, medical leaves and all national holidays. Job location all over India , nearest to your districtNo consultancy ,direct recruitment.Only interested candidates share the ResumeAirlines HR Thanks and RegardsHR Department", "companyname": "Sudharsan", "location": "Bengaluru / Bangalore,  Kolkata,  Rajahmundry,  Guwahati,  Patna", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Air Ticketing, Ground Staff, Customer Service Executive, Cabin Crew, Air Hostess, Administration, Air Cargo, Aviation, Management, Staff Nurse, Operations, Security, HR", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Ground Staff/ Cabin Crew/ Air Ticketing", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=a6jvCWd8Mj1zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description(Urgent opening for Any Under Grad/Graduated holders)Dear candidates,1)Requirement available in Air Ticketing / Ground Staff/ Cabin Crew/ Air Hostess.3)Qualification:-Any Under Grad/Graduated (Freshers & Experience)3)Vacancies:-104)Job Location:- Pan India5)Experience:-Freshers6)Salary: - As per Industry7)Duty: - 8 hoursInterested candidates please send your resume onwhatsapp or call : ( 92 66 71 38 95 )Regards,HR Department", "companyname": "VK Jobs", "location": "Belgaum,  Bengaluru / Bangalore,  Hubli,  Mangalore,  Mysoru / Mysore", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Airport Security, Administration, system admin, Ground staff, Cabin Crew, Air Ticketing, Air Hostess, flight attendant, HRcall9266713895", "startdate": "", "enddate": "Nov 6, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Area Sales Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=QxtkztfrP1hzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We Are Looking For a Recruitment & Development ManagerRoles & Responsibility:- - Team Leader's Profile- Forming an Advisory Group- Help advisors to do their jobs more effectively- Control the distribution network- Bring in business for the organization", "companyname": "TEKPILLAR SERVICES PRIVATE LIMITED", "location": "Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Kolkata,  Mangalore,  Bhubaneshwar", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Telecom, CASA, Medical, Real Estate, Credit, B2C, B2B, Direct, Equity, BFSI, FMCG, Marketing, Field Sales, Agency Channel, MR", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Senior agency manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=MTpXj3tEJnFzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Description:Achieve the sales revenue target in the assigned territoryChannel Development and Infrastructure (Distributors / Retailers)Monitor the performance of distributors, preferred retailers & take corrective actionsHandling Dealership related issues and challenges, achieving dealer business plan (for sales, manpower recruitment, funds, coverage, activities).Process ComplianceAggressive execution of Sales programs (i.e. new schemes / promotions / trade engagement etc.)Channel Management (Distributor / FOS / Retailer) to improve productivity and sales capabilities.Ensure optimum utilization of the territory by building up customer base / retailer networkIncrease market share of ones territory. Analyzing the market by collecting RTO DataTimely Collection of the market information such as competitor activities & initiatives and analyze the same with the help of Area Sales Manager to pre-empt its impact on the businessCommunication and Interpersonal Skills, Retail Market Expertise. Must be conversant with the local market & have the Sales Skills to achieve the Targets at the assigned territory.", "companyname": "First Solution", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Mumbai,  Pune", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "business development manager, sales manager, relationship manager", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Recruitment & Development Manager", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=aNjp6KiYZuJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We Are Looking For a Recruitment & Development ManagerBe proudly associated with India's largest private Life Insurance Company, recognized as one of the Great places to Work!Roles & Responsibility:- The recruitment and management of agents consists of locating, employing, and managing advisors from the proper location.By providing them with inspiration and training, advisers can increase their understanding of the products and market. Keep track of and assess the agent's efficacy.Help them make the greatest money that they can.To make sure that criteria are fulfilled, schedule frequent customer meetings. Implementing a sales strategy: Expand market penetration and reach by segmenting the market.Draw in new customers to boost sales. Essential Performance Measures: Agent RecruitmentEmploy Insurance Advisers and Offer Guidance, Inspiration, and Ideas.The role of the Team Leader.", "companyname": "TEKPILLAR SERVICES PRIVATE LIMITED", "location": "Bengaluru / Bangalore,  Davanagere,  Hubli,  Mangalore,  Mysoru / Mysore", "experience": "2 - 6 yrs", "salary": "", "type": "", "skills": "Telecom, CASA, Medical, Real Estate, Credit, B2C, B2B, Direct, Equity, BFSI, FMCG, Marketing, Field Sales, Agency Channel", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Post Merger Integration - J48121", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=vYBzrD8SysBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "- Take end to end responsibility for the strategic programs right from planning, team building, schedule assignments, monitor, review, and report project status and manage program risks to ensure successful implementation of the program- Facilitate requirement gathering interviews, conduct workshops, issue clarifications, review documentation, ensure traceability, sign off by all stakeholders and own the change management to define the program requirements- Engage with program stakeholders (internal and external) to build strong relationship and be the SPOC for all program related aspects- Demonstrate industry / process knowledge to translate business requirements to system requirements and proactively perform impact analysis of changes- Proactively identify the interdependencies among teams and drives convergence across teams to deliver organizational goals", "companyname": "SAMPOORNA CONSULTANTS PVT LTD", "location": "Bengaluru / Bangalore", "experience": "4 - 8 yrs", "salary": "", "type": "", "skills": "Corporate Strategy", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Urgent Vacancies Guest Service Officer  Air Hostess96166&42793", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=lCnAdzXaaQNzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Jobs in Airline Airport all domestic and international airport call for this job. Airlines HRD Rithika 96166&42793 VACANCY OPEN FOR AIRPORT JOBS AIRLINES AVIATION ALL INTERESTED CANDIDATES.Hurry Up! Lots Of Jobs In Airport & Aviation Industry Interested Candidate In Being a Of Job The Airline Family Seats Are Available. Job location:- nearest Airport'sStarting salary 29500 to 45500 Airlines Job Opened @ Ground staff and Air ticketing, CCE , Cabin Crew, Luggage Dept. , Front Desk , Floor supervisor , Manager, Helper, Loader, Executive and other so many post required manpower.Qualification: - 8th , 10th, 12th Pass to graduate & Post Graduate (Hospitality Aviation must apply) SA , CSA , BR , BA , CCE, Electrician & Technical operator, Tag Boy , Food Counter , Luggage Counter , Front Desk, Helper, Loader, Assistant Superviser, Driver, Assistant Floor In-charge, Computer Operator, Air Ticket In-Charge, Cabin Crew, Supervisor, Manager, ETC.GROUND STAFF Job- Male/Female, Fresher/Experience Both type JobCandidates required. Fresher s and Experienced both are welcome. INTERESTED CANDIDATE MUST APPLYAir ticketing, Technical & Mechanical, Service Associate (SA), Customer support Associate (CSA), Passport Checking, Luggage Scanning operator , Computer operator , Supervisor ,Cashier, Tag boy, Loader, Helper, Driver other so many posts.Facilities:Living, medical, fund, bounce, insurance, over time. 8 hours duty Sunday off, medical leaves and all national holidays. Job location all over India , nearest to your districtNo consultancy ,direct recruitment.Only interested candidates please call and follow the WhatsApp . 84485#43832 Airlines HRMiss Rithika 96166&42793 Thanks and RegardsAviation Department", "companyname": "Sudharsan", "location": "Vasco Da Gama,  Ranchi,  Bengaluru / Bangalore,  Thiruvananthapuram,  Bhopal", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Ground Staff, Aircraft Maintenance, Cabin Crew, Air Hostess, Airport Staff, guest service officer, passenger services officer, airport, fresher, airline, aviation, flight", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Airport/Airline Fresher/experience all. Meenakshi 92662&37706,✈️", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=N3KGqFFX__SLASH__XBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Jobs in Airline Aviation all domestic and international airport call me for this job. HRD Miss Meenakshi Rawat +91 92662&37706VACANCY OPEN FOR AIRPORT JOBS AIRLINES AVIATION ALL INTERESTED CANDIDATES.Hurry Up! Lots Of Jobs In Airport & Aviation Industry Interested Candidate In Being a Of Job The Airline Family Seats Are Available. Job location:- nearest Airport'sStarting salary 29500 to 45500 Airlines Job Opened @ Ground staff and Air ticketing, CCE , Cabin Crew, Luggage Dept. , Front Desk , Floor supervisor , Manager, Helper, Loader, Executive and other so many post required manpower.Qualification: - 8th , 10th, 12th Pass to graduate & Post Graduate (Hospitality Aviation must apply) SA , CSA , BR , BA , CCE, Electrician & Technical operator, Tag Boy , Food Counter , Luggage Counter , Front Desk, Helper, Loader, Assistant Superviser, Driver, Assistant Floor In-charge, Computer Operator, Air Ticket In-Charge, Cabin Crew, Supervisor, Manager, ETC.GROUND STAFF Job- Male/Female, Fresher/Experience Both type Job Candidates required. Freshers and Experienced both are welcome. INTERESTED CANDIDATE MUST APPLY Air ticketing, Technical & Mechanical, Service Associate (SA), Customer support Associate (CSA), Passport Checking, Luggage Scanning operator , Computer operator , Supervisor ,Cashier, Tag boy, Loader, Helper, Driver other so many posts.Facilities: Living, medical, fund, bounce, insurance, over time. 8 hours duty Sunday off, medical leaves and all national holidays.Job location all over India , nearest to your district No consultancy ,direct recruitment.Only interested candidates please send your contact details.Airlines HR Miss Meenakshi Rawat +91 92662&37706 Thanks and Regards Aviation Department", "companyname": "Sandeep K", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi,  Delhi/NCR", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Ground staff, computer operator, data entry, project manager, Air ticketing, Cabin crew, HR, Hospitality, Customer Service, Security gard, Housekeeping, Banking, Accountant", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Enterprise Risk Management - J48120", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=EhC6f6RHwZ5zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "External risk profiling - Gathering of external data/ insights through secondary research to monitor emerging developments which could impact the organizational risk profile. Work with the business functions to understand the strategic plan assumptions, challenge the conventional thinking, stress test assumptions and enable risk informed decision making by using risk framework Assist in performing a comprehensive review and analysis of material risks as it relates to company strategy and priorities by monitoring internal & external factors and understanding key business initiatives. Assist with review for consistency and completeness of action plans for risk management activities.", "companyname": "SAMPOORNA CONSULTANTS PVT LTD", "location": "Bengaluru / Bangalore", "experience": "4 - 8 yrs", "salary": "", "type": "", "skills": "Enterprise Risk Management", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Ground Staff job freshers apply fast vacancy open 926623&7706", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=wRlmCue6gsZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Jobs in Airline Aviation all domestic and international airport call me for this job. HRD Miss Meenakshi Rawat +91 92662&37706VACANCY OPEN FOR AIRPORT JOBS AIRLINES AVIATION ALL INTERESTED CANDIDATES.Hurry Up! Lots Of Jobs In Airport & Aviation Industry Interested Candidate In Being a Of Job The Airline Family Seats Are Available. Job location:- nearest Airport'sStarting salary 29500 to 45500Airlines Job Opened @ Ground staff and Air ticketing, CCE , Cabin Crew, Luggage Dept. , Front Desk , Floor supervisor , Manager, Helper, Loader, Executive and other so many post required manpower.Qualification: - 8th , 10th, 12th Pass to graduate & Post Graduate (Hospitality Aviation must apply)SA , CSA , BR , BA , CCE, Electrician & Technical operator, Tag Boy , Food Counter , Luggage Counter , Front Desk, Helper, Loader, Assistant Superviser, Driver, Assistant Floor In-charge, Computer Operator, Air Ticket In-Charge, Cabin Crew, Supervisor, Manager, ETC.GROUND STAFF Job- Male/Female, Fresher/Experience Both type JobCandidates required. Freshers and Experienced both are welcome. INTERESTED CANDIDATE MUST APPLYAir ticketing, Technical & Mechanical, Service Associate (SA), Customer support Associate (CSA), Passport Checking, Luggage Scanning operator , Computer operator , Supervisor ,Cashier, Tag boy, Loader, Helper, Driver other so many posts.Facilities:Living, medical, fund, bounce, insurance, over time. 8 hours duty Sunday off, medical leaves and all national holidays.Job location all over India , nearest to your district No consultancy ,direct recruitment.Only interested candidates please send your contact details. Airlines HR Miss Meenakshi Rawat +91 92662&37706 Thanks and Regards Aviation department.", "companyname": "Amit Kumar", "location": "Bellary,  Bengaluru / Bangalore,  Gulbarga,  Hubli,  Mangalore", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Ground staff, Airline Ticketing, Cabin crew, Hospitality, Customer Service, team leader, manager, Back office, Security gard, Hr, Lodar, Screening, Hiring, AAI, Calling, Ect.", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Assistant Vendor Management Support Desk - J48139", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=__PLUS__VqvUDL3LFJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "? Maintaining the Engage3 competitive price matching portal for all 3P SKUs. This includes crawling competitor sites to appropriately match products .? Executing on the set-up of new products from 3P vendors. This is a highly manual process with extremely limited automation.? Pulling SKU level data and reporting in support of promotional events. This is a highly manual process with extremely limited automation.? Scrubbing prior to major promotional events of tentpoles to ensure 3P products are instock, content meets our quality bar and pricing is accurate.? Issuing credit memos to vendors based on promotional funding or other accounts payable/accounts receivable needs.", "companyname": "SAMPOORNA CONSULTANTS PVT LTD", "location": "Bengaluru / Bangalore", "experience": "4 - 6 yrs", "salary": "", "type": "", "skills": "Merchandising", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Sales Officer - On Roll", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=F4qKOSaj3nBzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Recruitment and Team Building:Identify and recruit talented individuals to join the agency as insurance agents.Train and onboard new agents, providing them with the necessary product knowledge and sales skills.Foster a high-performing and motivated agency team through coaching and mentoring.Sales Target Achievement:Develop and implement strategic sales plans to achieve sales targets and revenue goals.Monitor and analyze team performance, providing guidance and support to ensure targets are met or exceeded.Continuously assess market trends and competition to identify opportunities for growth. Agent Development:Conduct regular training sessions to enhance agents' product knowledge and selling techniques.Provide ongoing support and guidance toagents, addressing their concerns and helping them improve their sales skills.", "companyname": "Supro Consulting", "location": "Bengaluru / Bangalore,  Hyderabad/Secunderabad,  Vijayawada,  Visakhapatnam,  Calicut/ Kozhikode", "experience": "1 - 6 yrs", "salary": "", "type": "", "skills": "sales, Marketing, Direct Sales, Field sales, BFSI Sales, B2B Sales, B2c Sales, FMCG Sales, Channel Sales, team leader, Banking, Loan, CASA, Credit card Sales, Insurance, BDM", "startdate": "", "enddate": "Nov 6, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Urgent Hiring For Airport Jobs", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=6gYk8C__PLUS__M18lzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job Description(Urgent opening for Any Under Grad/Graduated holders)Dear candidates,1)Requirement available in Air Ticketing / Ground Staff/ Cabin Crew/ Air Hostess.3)Qualification:-Any Under Grad/Graduated (Freshers & Experience)3)Vacancies:-104)Job Location:- Pan India5)Experience:-Freshers6)Salary: - As per Industry7)Duty: - 8 hoursInterested candidates please send your resume onwhatsapp or call : (926 674 39 11)Regards,HR Department", "companyname": "VK Jobs", "location": "Belgaum,  Bengaluru / Bangalore,  Hubli,  Mangalore,  Mysoru / Mysore", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Airport Security, Administration, system admin, Ground staff, Cabin Crew, Air Ticketing, Air Hostess, flight attendant, Call HR 926 674 3911", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Relationship Manager_On roll", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=dyWny9kqlT1zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Recruitment & Development:Identify and recruit new insurance agents. Provide training, support, and ongoing development to ensure agents are knowledgeable about products and effective in their sales strategies.Performance Management: Monitor and evaluate agent performance. Set performance targets, provide feedback, and implement improvement plans as needed.Sales Strategy:Develop and execute strategies to increase sales and market penetration through the agency channel. Analyze market trends and competitor activity to adjust strategies accordingly.Relationship Management: Build and maintain strong relationships with agency partners. Address any issues or concerns and ensure a high level of satisfaction and engagement.Compliance:Ensure that all agents adhere to company policies, industry regulations, and ethical standards.Reporting & Analysis: Track and report on sales performance and other key metrics. Provide regular updates to senior management and recommend adjustments to strategies based on performance data.Marketing Support:Collaborate with the marketing team to create promotional materials and campaigns tailored to the agency channel.", "companyname": "Supro Consulting", "location": "Bengaluru / Bangalore,  Delhi,  Gurgaon,  Hyderabad/Secunderabad,  Mumbai", "experience": "1 - 6 yrs", "salary": "", "type": "", "skills": "Sales, Marketing, Insurance, Banking, Banca, Pharma, Channel Sales, Direct Sales, Agency Sales, BFSI, FMCG, NBFC, B2B, B2C, RM, MR, SM, SE, BDM, CASA, Bank, Loans, Finance, RE, SO, ASM", "startdate": "", "enddate": "Sep 16, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "APPLY URGENT AIRPORT JOBS AIRLINES GROUND STAFF,92662 & 37706,✈️", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=r5f7daQlI31zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Jobs in Airline Aviation all domestic and international airport call me for this job. HRD Miss Meenakshi Rawat +91 92662&37706VACANCY OPEN FOR AIRPORT JOBS AIRLINES AVIATION ALL INTERESTED CANDIDATES.Hurry Up! Lots Of Jobs In Airport & Aviation Industry Interested Candidate In Being a Of Job The Airline Family Seats Are Available. Job location:- nearest Airport'sStarting salary 29500 to 45500 Airlines Job Opened @ Ground staff and Air ticketing, CCE , Cabin Crew, Luggage Dept. , Front Desk , Floor supervisor , Manager, Helper, Loader, Executive and other so many post required manpower.Qualification: - 8th , 10th, 12th Pass to graduate & Post Graduate (Hospitality Aviation must apply) SA , CSA , BR , BA , CCE, Electrician & Technical operator, Tag Boy , Food Counter , Luggage Counter , Front Desk, Helper, Loader, Assistant Superviser, Driver, Assistant Floor In-charge, Computer Operator, Air Ticket In-Charge, Cabin Crew, Supervisor, Manager, ETC.GROUND STAFF Job- Male/Female, Fresher/Experience Both type Job Candidates required. Freshers and Experienced both are welcome. INTERESTED CANDIDATE MUST APPLY Air ticketing, Technical & Mechanical, Service Associate (SA), Customer support Associate (CSA), Passport Checking, Luggage Scanning operator , Computer operator , Supervisor ,Cashier, Tag boy, Loader, Helper, Driver other so many posts.Facilities: Living, medical, fund, bounce, insurance, over time. 8 hours duty Sunday off, medical leaves and all national holidays.Job location all over India , nearest to your district No consultancy ,direct recruitment.Only interested candidates please send your contact details.Airlines HR Miss Meenakshi Rawat +91 92662&37706 Thanks and Regards Aviation Department", "companyname": "Sandeep K", "location": "Belgaum,  Bellary,  Bengaluru / Bangalore,  Gulbarga,  Hubli", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Ground staff, computer operator, data entry, project manager, Air ticketing, Cabin crew, HR, Hospitality, Customer Service, Security gard, Housekeeping, Banking, Accountant", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Software Tester", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=CBECD2TRYtJzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Call or WhatsApp to check your eligibility Aman - Nine eight six three nine three seven seven three six Role & Responsibilities :Develop and execute test plans to validate software functionality against requirements and specifications. Identify, report and track software defects and issues. Perform functional, performance, security and regression testing of software products. Report test results and defects to the development team and other stakeholders and work on their resolution. Provide suggestions and feedback to improve the quality of the software development process across teams.", "companyname": "SKYWALK VISA IMMIGRATION SERVICES LLP", "location": "Bengaluru / Bangalore,  Chennai,  Singapore", "experience": "4 - 9 yrs", "salary": "", "type": "", "skills": "software testing, tester, Testing Analysing, Software Quality Testing", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "\"Affiliate Onboarding  Activation Manager \"", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=cEmNUUujM8hzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Affiliate Onboarding Activation ManagerWe Are Hiring ACTs ( Affiliate Onboarding Activation Manager ) Project Search it can be part-time, and work may be remote. Convenient for digital nomads, those who lead a lifestyle where they can work and travel at the same time.Responsibilities:- Build up the network of potential partners; hold entertainment events for the network s development- Hold meetings with potential partners- Hold marketing and business meetings, as well as presentations; live communication with potential partners- Follow up and build up personal contacts and trust aimed at increasing the company's recognition.- Handle both short-term and long-term potential affiliate-related projects.Requirements:- Excellent MS Office knowledge- Excellent verbal and written communication skills- Excellent organizational skills and ability to multitask - Ability to be proactive and take the initiative- Related experience is a plus", "companyname": "Fintech_HR", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Delhi/NCR,  Lucknow", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Sales", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "PHP Developer", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Nh8MqRimWSlzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "CALL FOR MORE INFO :(AMAN-NINE EIGHT SIX THREE NINE THREE SEVEN SEVEN THREE SIX)PHP is a popular language, easy to learn and master since it is based on C and JavaPHP development has a simple, feature-rich approach with other readily available frameworks and technologiesThere is an increasing list of organizations seeking the use of PHP in their projectsIt is free, open-source, and supports OOPS via data encapsulation, inheritance, etc.It is flexible, dynamic, and compatible with almost all operating systemsThere is sufficient documentation and community support for developers", "companyname": "SKYWALK VISA IMMIGRATION SERVICES LLP", "location": "Bengaluru / Bangalore,  Chennai,  Australia,  Singapore", "experience": "2 - 7 yrs", "salary": "", "type": "", "skills": "Java, PHP Developing, PHP Scripting, PHP MySQL, php program, php web developer", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Urgent Airport Ground Staff and Air Hostess Vacancies 74O8171531", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=GDhoUng39Y5zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "HR Mr. Amit - (74O8171531)Interview for an International and Domestic Airport Cabin Crew and Ground Staff Positions for Both Males and Females ( Freshers and Experience as well ) Required Fresher and Experience, Skills, and Qualifications Only 58 Openings ( 35 Females - 23 Males ) Taking care of the safety and security of the passengers on flights. Need to Serve Meals on Board to the Customers with a Hospitality Attitude Person should have unblemished complexion and good body language. Excellent communication and verbal skills. Knowledge of Fare calculations and group reservations is required. should possess excellent communication and interpersonal skills, good analytical skills in interpreting data and situations. Will responsible for Handling of Group Queries (both domestic and International). Will need to action group queries by coordinating with concern airlines. Will need to talk to travel agents & understand their requirement about group fare & try to match budget for group closure. Will need to reply Flight and Fare Enquiries. Handling over all Ticketing and Refunds of tickets. Agent and Corporate query relating to reservation and ticketing. Department : Ground Staff and Cabin Crew Employment Type: Full Time, Permanent Role Category: Voice / Blended Education (High School Intermediate UG: Any Graduate PG: Any Postgraduate)HR Mr. Amit- (74O8171531)", "companyname": "JITENDRA KUMAR", "location": "Belgaum,  Bengaluru / Bangalore,  Davanagere,  Gulbarga,  Mangalore", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Customer Handeling", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Kotak Life Insurance - Wealth Channel Hiring", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=sUSH__SLASH__9q__SLASH__fKNzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Relationship manager (Wealth Channel )Experience is *mandatory*-Candidates should have had handled a team of agents with good relationships-CTC can go upto 8LPA (depending on the case) -Age criteria - Max 32-35y/oAllotment will be according to the closest location of the candidate Location:- Mumbai, Ahmedabad, Baroda,Surat,Bangalore,Pune, Nasik, Delhi, Kolkata and Chennai-Minimum of 2 years of agency experience is *mandatory*-Candidates should have had handled a team of agents with good relationships -CTC can go upto 7-8LPA (depending on the case)-Age criteria - Max 30-35y", "companyname": "First Solution", "location": "Ahmedabad,  Bengaluru / Bangalore,  Chennai,  Pune,  Vadodara", "experience": "5 - 10 yrs", "salary": "", "type": "", "skills": "associate sales manager, territory sales manager, unit sales manager, sales development manager, branch sales manager, senior agency manager, key relationship manager", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Computer Operator/Data Entry Operator", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=Zketc__SLASH__8Mio5zpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "We are Looking Data Entry Operators. Who can do data entry with Good English .ommunication skills should be good.Candidates willing to do online work also is Ok.Positions are Entry level Job Positions.Only Freshers are welcomed.Basic computer application skills & data management Skills", "companyname": "Yugayatra Retail OPC Private Limited", "location": "Bengaluru / Bangalore,  Chennai,  Delhi/NCR,  Hyderabad/Secunderabad,  Pune", "experience": "0 - 1 yrs", "salary": "", "type": "", "skills": "Canva", "startdate": "", "enddate": "Nov 4, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}, {"title": "Data Entry Operator / Computer Operator- Bengaluru/Chennai/Hyd", "applylink": "http://www.timesjobs.com/candidate/JobDetailView.html?adId=TlZ__PLUS__p3spJTZzpSvf__PLUS__uAgZw==&bc=INT&searchName=inner&from=submit&txtKeywords=&fnm=JB", "jd": "Job descriptionOur Company is looking for Data Entry Operator / Computer Operator to join our dynamic team and embark on a rewarding career journeyAccurately enter and update data into databases, spreadsheets, and other digital systems, ensuring data integrity and confidentiality.Verify and correct data discrepancies, maintaining accurate and up-to-date records.Perform regular data backups and ensure data security.Generate and prepare reports, summaries, and data analysis as required.Collaborate with team members to ensure efficient data processing and workflow.Maintain an organized filing system for physical and digital records.Bengaluru, Chennai, Hyderabad, Kochi and Pune Locations most preferred.", "companyname": "Bytebrains", "location": "Bengaluru / Bangalore,  Chennai,  Hyderabad/Secunderabad,  Pune,  Cochin/ Kochi/ Ernakulam", "experience": "0 - 3 yrs", "salary": "", "type": "", "skills": "Computer Operator, data entry operator, Typing, 30 Wpm, 40 Wpm, Data Entry, Word, vlookup, H-lookup, Mis Reports, Back Office Support, email, powerpoint, Erp, processing", "startdate": "", "enddate": "Nov 5, 2024 12:00:00 AM", "created": "", "source": "timesjobs", "timestamp": 1725706384.4986658}]